title: Detecting Credential Dumping Tools (Mimikatz)
id: 392c4891-ded7-4ec6-84b0-f1dbf04f0f09
description: Detects the execution of credential dumping tools like Mimikatz, commonly used to extract passwords and credentials from memory.
status: stable
author: Rajshekar Vijay
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\mimikatz.exe'
      - '\mimikatz_trunk\mimikatz.exe'
    CommandLine|contains:
      - 'sekurlsa'
      - 'logonpasswords'
  condition: selection
fields:
  - CommandLine
  - Image
falsepositives:
  - Legitimate use by system administrators
level: high
tags:
  - attack.credential_access
  - attack.t1003
